# expand our horizon
tap "homebrew/bundle"
tap "homebrew/core"

# core binaries
brew "ack" # instead of grep
brew "awscli"
brew "coreutils" # those that come with macOS are outdated
brew "chrome-cli"
brew "ffmpeg"
brew "findutils"
brew "gh"
brew "git"
brew "gnupg2"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "mackup"
brew "mas" # Mac App Store manager
brew "openssh"
brew "pinentry-mac"
brew "ruby"
brew "thefuck"
brew "trash" # manage the Trash bin
brew "tree" # list directories in a tree structure
brew "wget"

# terminal
brew "bash" # latest Bash version
brew "glances"
brew "htop"
brew "iperf"
brew "neovim" # instead of vim
brew "starship"
brew "tmux"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# development
brew "enchant"
brew "node"
brew "nginx"
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "readline"
brew "openssl"
brew "zlib"
