# expand our horizon
tap "homebrew/bundle"
tap "homebrew/core"

# core binaries
brew "ack" # instead of grep
brew "awscli"
brew "bash" # Latest Bash version
brew "bats" # "cat" on steroids
brew "coreutils" # Those that come with macOS are outdated
brew "dockutil"
brew "ffmpeg"
brew "findutils"
brew "gh"
brew "git"
brew "gnupg2"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "mackup"
brew "mas" # Mac App Store manager
brew "openssh"
brew "stow"
brew "trash" # Manage the Trash bin
brew "tree" # List directories in a tree structure
brew "wget"

# deveopment
brew "node"
brew "nginx"
brew "python"
